Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/moving_country/asylum_seekers_and_refugees/the_asylum_process_in_ireland/rights_and_obligations_of_asylum_seekers_in_ireland.html.txt.tmx
Source language: en
Languages: ga

source: Rights and obligations of asylum seekers in Ireland
ga: Cearta agus oibleagáidí na niarrthóirí tearmainn

source: During the period that your application for international protection is being processed in Ireland, you have certain rights and obligations under the International Protection Act 2015
ga: Bíonn cearta agus oibleagáidí áirithe agat le linn na tréimhse ina mbíonn tú i d'iarrthóir tearmainn agus go mbíonn d’iarratas ar dhearbhú mar theifeach á phróiseáil; agus is mar seo a leanas iad:

source: • Unless your case is to be dealt with in accordance with the Dublin III Regulation, you will not be removed from the State until you have been given the opportunity to present your case fully to the International Protection Office
ga: • Mura mbítear chun plé le do chás de réir Rialachán Bhaile Átha Cliath III ní bhainfear den Stát tú nó go dtugtar caoi duit do chás láithriú ina iomláine chuig an gCoimisinéir Iarratais do Dhídeanaithe nó chuig an mBinse Achomhairc do Dhídeanaithe, de réir mar is cuí

source: • Every effort will be made to provide you with an interpreter, where necessary and possible
ga: • Déanfar gach iarracht chun teangaire a sholáthar duit, de réir mar is gá agus is féidir

source: • You are entitled to consult a solicitor
ga: • Bíonn tú i dteideal dul i gcomhairle le haturnae

source: The Refugee Legal Service is an independent body that provides legal assistance to individuals applying for international protection
ga: Is comhlacht neamhspleách í Seirbhís Dhlíthiúil na dTeifeach a sholáthraíonn cúnamh dlíthiúil do dhaoine aonair a bhíonn ag déanamh iarratais ar dhearbhú mar theifeach a fháil

source: An information leaflet about the Refugee Legal Service will be given to you when you make your initial application
ga: Tabharfar bileog eolais faoi Sheirbhís Dhlíthiúil na dTeifeach duit nuair a dhéanann tú do chéadiarratas

source: • You are entitled to consult with the United Nations High Commissioner for Refugees (UNHCR) who has an office in Dublin
ga: • Bíonn tú i dteideal dul i gcomhairle le hArd-Choimisinéir na Náisiún Aontaithe do Theifigh (UNHCR) a bhfuil oifig aige i mBaile Átha Cliath

source: • The Reception and Integration Agency will provide you with accommodation (on a full board basis) in one of their accommodation centres while your application for international protection is being processed
ga: • Cuirfidh an Ghníomhaireacht um Fháiltiú agus Comhtháthú cóiríocht ar fáil duit (ar bhonn lánchoinneála) i gceann amháin dá lár-ionaid chónaithe a fhad agus a bhíonn d’iarratas ar thearmann á phróiseáil

source: You are entitled to welfare support and health care while your application is being processed
ga: Bíonn an teidlíocht agat ar thacaíocht leasa agus cúram sláinte a fhad agus a bhíonn d’iarratas á phróiseáil

source: • All details provided in connection with your application will be treated in confidence
ga: • Caithfear faoi rún le gach mionsonra i leith d’iarratais

source: Information may, however, be disclosed to other bodies that may be dealing with you, such as government departments and agencies, including the immigration authorities, An Garda Síochána (the Irish Police), local authorities and the UNHCR, to enable these organisations carry out their functions. These functions include administering the law relating to the entry and removal from the State of foreign nationals
ga: Féadtar faisnéis a nochtadh, ámh, chuig comhlachtaí eile a d’fhéadfadh a bheith ag plé leat, ar nós ranna agus gníomhaireachtaí rialtas na hÉireann lena n-áirítear na hÚdaráis Inimirce, an Garda Síochána, údaráis áitiúla chomh maith le UNHCR chun a chur ar chumas na n-eagras seo a bhfeidhmeanna a stiúradh lena n-áirítear riarachán an dlí a bhaineann le hiontráil agus díbirt ón Stát de neamh-náisiúnaigh

source: Some information may also be provided to other countries operating the Dublin III Regulation for the purpose of operating these arrangements
ga: Féadtar roinnt faisnéise a sholáthar freisin chuig tíortha eile a oibríonn Rialachán Bhaile Átha Cliath III chun críche oibriú na socrúchán seo

source: • You will be notified in writing at the most recent address given by you of any appointments you must keep and any recommendations made or decisions taken in connection with your application for international protection by the International Protection Office, the International Protection Appeals Tribunal and the Minister for Justice and Equality (as appropriate)
ga: • Fógrófar duit i scríbhinn, ag an seoladh is déanaí ar thug tú, d’aon choinne a mbeidh ort a choinneáil agus aon mholadh a dhéantar nó aon chinneadh a thógtar i gcomhar le d’iarratas ar dhearbhú mar theifeach ag an gCoimisinéir Iarratais do Dhídeanaithe, an Bínse Achomhairc do Dhídeanaithe agus an tAire Dlí agus Cirt (de réir mar is cuí)

source: • You must comply with the laws of the State
ga: • Ní mór duit cloí le dlíthe an stáit

source: • You must notify, in writing, the Minister for Justice and Equality of your address as soon as possible and any change of address
ga: • Ní mór duit do sheoladh a fhógairt i scríbhinn don Choimisinéir Iarratais do Dhídeanaithe (laistigh de 5 lá oibre ó dhéanamh d’iarratais) agus i leith aon athrú i do sheoladh

source: Failure to do so could result in you being found guilty of an offence under the International Protection Act 2015
ga: Má mhainníonn tú sa mhéid sin, d'fhéadfaí tú a chiontú as cion faoi Acht na nDídeanaithe 1996, arna leasaithe

source: Failure to do so could also result in you not receiving important notifications in relation to your application and consequently failing to meet time limits for lodging documentation, appeals, and so on
ga: D’fhéadfaí nach bhfaighfeá fógraí tábhachtacha i ndáil le d’iarratais freisin le mainneachtain ar do leithse agus go dteipfeadh ort chun teorainneacha ama a shásamh um thaisceadh cáipéisíochta, achomharc agus mar sin de

source: You can find out more about offences under the International Protection Act 2015 – see 'Further information' below
ga: Tá faisnéis faoi chionta i gcoinne Acht na nDídeanaithe 1996 i 'Tuilleadh eolais' thíos

source: • In all correspondence with the International Protection Office or the International Protection Appeals Tribunal you should clearly indicate your name, address, nationality, and the reference number shown on your temporary residence certificate
ga: • Ba cheart duit d’ainm, seoladh, náisiúntacht, agus an Uimhir Thagartha a thaispeántar ar do Theastas um Chónaitheacht Shealadach a chur in iúl go soiléir ar gach comhfhreagras leis an gCoimisinéir Iarratais do Dhídeanaithe nó leis an mBínse Achomairc do Dhídeanaithe

source: • You must not leave or attempt to leave the State without the consent of the Minister for Justice and Equality while your application is under consideration
ga: • Ní féidir leat an stát a fhágáil ná iarracht a dhéanamh chun na críche sin gan comhthoil an Aire Dhlí agus Chirt a fhad agus a bhíonn d’iarratas á mheas

source: • You are not entitled to seek or enter employment or carry on any business, trade or profession
ga: • Ní bhíonn teidlíocht agat chun fostaíocht a lorg ná chun dul ina bun

source: • You may be required to report at specified intervals to an immigration officer or to a specified Garda station
ga: • Ní bhíonn tú i dteidil chun aon ghnó, ceird ná gairm a chleachtadh

source: • You are required to reside or remain at the accommodation centre allocated to you by the Reception and Integration Agency (RIA)
ga: • Féadann tú a bheith faoi riachtanas chun dul i láthair Oifigeach Inimirce, duine le húdarú ón Aire Dlí agus Cirt nó ball den Gharda Síochána ag eatraimh shonraithe

source: • You can only move from this accommodation with the permission of the RIA and only in circumstances where the RIA is in a position to offer you alternative accommodation
ga: • Ní féidir leat bogadh ón lóistín sin ach le cead na GFC agus is sa chás amháin go mbíonn ar chumas na GFC lóistín ailtéarnach a thairscint duit, a tharlóidh sé seo

source: • You must be truthful at all times in the information you provide in connection with your application
ga: • Caithfidh tú a bheith fírinneach i gcónaí san fhaisnéis a sholáthraíonn tú i leith d’iarratais

source: If you are not, it may lead to a finding that your application is manifestly unfounded
ga: Mura mbíonn, d’fhéadfaí a chinneadh as gur gan foras ar bith atá d’iarratas

source: In such circumstances, you would have a shorter period within which to appeal and any appeal you might make would be dealt with without an oral hearing
ga: Sna cásanna sin, bheadh tréimhse ní ba ghiorra le hachomharc laistigh di agus phléifí le haon achomharc a d’fhéadfá a dhéanamh gan éisteacht bhéil

source: • You must co-operate fully with the investigation of your application
ga: • Ní foláir duit comhoibriú go hiomlán le fiosrú d’iarratais

source: Failure to do so could affect the credibility of your application or result in your application being deemed withdrawn
ga: D’fhéadfadh mainneachtain chun déanamh amhlaidh a chur isteach ar inchreidteacht d’iarratais nó d’iarratas a bheith aistarraingthe dá thoradh

source: • You should make all information relevant to your application available to the International Protection Office
ga: • Ba cheart duit gach faisnéis ábhartha do d’iarratas a chur ar fáil don Choimisinéir Iarratais do Dhídeanaithe

source: If you do not do so and seek to bring forward additional information at appeal stage, you will be required to explain why this information was not made available to the International Protection Office. The International Protection Appeals Tribunal will be required to take this into account in assessing the credibility of your application
ga: Mura ndéanann tú amhlaidh agus má lorgann le faisnéis bhreise a thabhairt ar aghaidh ag staid an achomhairc, beidh ort an fáth nár cuireadh an fhaisnéis seo ar fáil don Choimisinéir Iarratais do Dhídeanaithe a mhíniú agus beidh ar an mBínse Achomhairc do Dhídeanaithe é seo a chur san áireamh i measúnú inchreidteacht d’iarratais

source: • You must provide the International Protection Office or the International Protection Appeals Tribunal (as appropriate), with details of your solicitor and any change of solicitor (name, address, phone number, and so on)
ga: • Ní foláir duit mionsonraí do dhlíodóirse agus aon athrú dlíodóra (ainm, seoladh, uimhir ghutháin, agus mar sin de) a sholáthar don Choimisinéir Iarratais do Dhídeanaithe nó don mBínse Achomhairc do Dhídeanaithe (de réir mar is iomchuí)

source: • You or your solicitor must retain all copies of documentation given to you by the International Protection Office and the International Protection Appeals Tribunal
ga: • Ní mór duit féin nó do do dhlíodóir gach cóip den cháipéisíocht a thugann an Coimisinéir Iarratais do Dhídeanaithe agus an Bínse Achomhairc do Dhídeanaithe duit a choinneáil

source: Only in exceptional circumstances will additional copies of the documents be made available
ga: Is i gcúinsí eisceachtúla amháin a chuirfear cóipeanna breise de na cáipéisí ar fáil

source: Applications which may be deemed to be withdrawn
ga: Iarratais a d’fhéadfaí a mheas mar aistarraingthe mar gheall ar mhainneachtain chun cloí le hoibleagáidí áirithe

source: There are a number of circumstances in which failure on your part to comply with your statutory obligations may result in your application for international protection being deemed withdrawn. In this case, the Minister for Justice shall refuse to give you a declaration
ga: Bíonn roinnt cúinsí ann ina d’fhéadfaí d’iarratas ar stádas teifigh a mheas mar aistarraingthe de bharr mainneachtana ar do leithse chun comhall le d’oibleagáidí reachtúla; agus ina dhiúltóidh an tAire dearbhú a thabhairt duit

source: Irish Naturalisation and Immigration Service
ga: Seirbhís Eadóirseachta agus Inimirce na hÉireann

source: Opening Hours:Mon-Fri 9.30am-1pm, 2-4.30pm
ga: Uaireanta Oscailte:Lu-hAo 9.30rn-1in, 2-4.30in

source: Tel:+353 1 602 8000
ga: Teil:+353 1 602 8000

source: Fax:+353 1 602 8122
ga: Facs:+353 1 602 8122

source: United Nations High Commissioner for Refugees (UNHCR)
ga: Ard-Choimisinéir na Náisiún Aontaithe do Theifigh (UNHCR)

source: Tel:+353 (0)1 631 4510
ga: Teil:+353 (0)1 631 4510

source: Fax:+353 (0)1 632 8676
ga: Facs:+353 (0)1 632 8676

source: Reception and Integration Agency
ga: An Ghníomhaireacht um Fháiltiú agus Imeascadh

source: Tel: +353 1 418 3200
ga: Teil: +353 1 418 3200

source: Fax:+353 1 418 3271
ga: Facs:+353 1 418 3271

source: Offences contrary to the International Protection Act 2015
ga: Cionta i gcoinne Acht na nDídeanaithe 1996

source: An applicant for international protection who:
ga: Aon iarrthóir ar dhearbhú mar theifeach:

source: • Leaves or attempts to leave the State without the permission of the Minister for Justice and Equality
ga: • A fhágann nó a dhéanann iarracht an stát a fhágáil gan cead ón Aire Dlí agus Cirt agus Chomhionnanais

source: • Seeks or enters employment or carries on any business, trade or profession during the period before the final determination of their application for a declaration
ga: • A lorgaíonn nó a théann i mbun fostaíochta nó a dhéanann aon ghnó, ceird nó gairm i rith na tréimhse roimh an gcinneadh deiridh dá n-iarratais ar dhearbhú

source: • Fails to inform the Minister of their address or any change of address
ga: • A mhainníonn an Coimisinéir Achomhairc do Dhídeanaithe a chur ar an eolas faoina seoladh nó faoi aon athrú ina seoladh

source: • Fails to comply with a requirement to reside or remain in particular districts or places in the State or to report at specified intervals to an immigration officer or member of the Garda Síochána
ga: • Nach gcomhlíonann an dualgas cónaí nó fanacht i gceantair nó áiteacha áirithe sa stát nó tuairisciú ag eatraimh shonracha chuig oifigeach inimirce nó ball den Gharda Síochána;

source: • Forges or fraudulently alters, or assists in forging or fraudulently altering or procures the forging or fraudulent alteration of a Temporary Residence Certificate
ga: • Bhrionnaíonn nó a athraíonn go calaoiseach Teastas Sealadach Cónaitheachta

source: • Gives or makes false or misleading information or statements for the purposes of, or in relation, to an application for a declaration as a refugee
ga: • Chuidíonn i mbrionnú nó in athrú calaoiseach nó a thugann chun críche brionnú nó athrú calaoiseach de Theastas Sealadach Cónaitheachta

source: • Destroys or conceals identity documents with intent to deceive for the purposes of, or in relation to, an application for a declaration as a refugee
ga: • Scriosann nó a fholaíonn cáipéisí aitheantais leis an rún chun dallamullóg a chur ar dhaoine chun críoch, nó i ndáil le hiarratas ar dhearbhú mar theifeach;

source: will be guilty of an offence under the International Protection Act 2015 and may be liable to a fine and/or imprisonment on summary conviction
ga: beidh an duine sin ciontach as cion agus féadann a bheith faoi dhliteanas fineáil a íoc agus/nó príosúnacht a bheith gearrtha ort ar chiontú achomair

source: • Forges or fraudulently alters, or assists in forging or fraudulently altering or procures the forging or fraudulent alteration of a temporary residence certificate
ga: • Bhrionnaíonn nó a athraíonn go calaoiseach, nó a chuidíonn i mbrionnú nó in athrú calaoiseach nó a thugann chun críche lena bhrionnú nó a athraíonn go calaoiseach aon cháipéisí aitheantais ar luach saothair, leis an rún chun na cáipéisí sin a úsáid chun críoch, nó i ndáil le, iarratas ar dhearbhú mar theifeach

source: • Gives or makes false or misleading information or statements for the purposes of, or in relation, to an application for international protection
ga: • Dhíolann nó a sholáthraíonn, nó a bhíonn i seilbh chun críoch díola nó soláthair, cáipéisí aitheantais bhrionnaithe leis an rún chun na cáipéisí sin a úsáid chun críoch, nó i ndáil le hiarratas ar dhearbhú mar theifeach;

source: • Destroys or conceals identity documents with intent to deceive for the purposes of, or in relation to, an application for international protection
ga: beidh an duine sin ciontach as cion agus féadann a bheith faoi dhliteanas fineáil a íoc agus/nó príosúnacht a bheith gearrtha ort ar chiontú achomair nó ar chiontú ar díotáil

source: • Who operates a port or other place that is not an approved port and facilitates the landing in the State at that port or other place by another person so that the other person thereby commits an offence under the Immigration Act 2003 or who, knowing that another person has committed such an offence at that port or other place, fails to report the circumstances to an immigration officer
ga: Féadann ball den Gharda Síochána duine a ghabháil gan barántas a d’fhéadfadh a bheith faoi amhras go ndearna siad, nó go raibh cion déanta acu

source: will be guilty of an offence and may be liable to a fine and/or imprisonment on summary conviction or on conviction on indictment
ga: Cúinsí inar féidir iarrthóir ar stádas teifigh a choinneáil

source: A member of the Garda Siochana may arrest without a warrant a person who may be reasonably suspected of committing, or of having committed, an offence
ga: • Go bhfuil rún agat díbirt ón Stát a sheachaint, sa chás nach n-éiríonn le d'iarratas • Go bhfuil sé ar intinn agat an Stát a fhágáil agus ceann eile a iontráil gan údarás dlíthiúil
